/*
Дан массив строк
Необходимо написать функцию, которая удаляла бы из массива все строки, которые нельзя перевести в дату и возвращала бы новый массив вида - ['10-10-2022']
*/

const arrStr = ['10-02-2022', 'тест', '11/12/2023', '00/13/2022', '41/12/2023'];

// Valid data = '10-02-2022' or '11/12/2023'

function isDate(str) {
    console.log(str);
    const arr = [];

    return arr;
    /*
	Отфильтровать на даты и не даты, последние выкинуть
	Остальное преобразовать в формат ['10-02-2022']
	вернуть результирующий массив из строк
	*/
}

isDate(arrStr);
